import { Response, ResponseGoal } from '../core/response';
import { departments } from '../utils/aliases';
import { any } from '../utils/regex';

export default class extends Response {
  goal = ResponseGoal.DEPARTMENT;
  reply = 'Здесь можно найти полезную информацию про кафедры:';
  expression = any([
    '(как(ой|ая|ую|их)|як(а|у|их|ій|ий)).*(кафедр(а|у|е|і|ах)|катедр(і|а|у|ах)).*(лучше|кращ(а|е)|легче|легше)',
    '(в(и|ы)брат(и|ь)|обрати|разница|різниця).*(кафедр(а|у|е|і|ах)?|катедр(і|а|у|ах)?)',
    `(чем|чим|почему|чому|в каком плане|у якому (сенсі|плані)).*(${departments}|(кафедр(ы|и|а|у|е|і|ах)|катедр(и|і|а|у|ах))).*(лучше|кращ(а|е)|отлича(е|ю)ть?ся|відрізня(я|ю)ть?ся).*${departments}?`,
    `${departments}.*(лучше|краща|краще|или|чи|або).*${departments}.*\\?`,
    `(как(ая|ие)?|як(і|а)?).*(кафедр(ы|и|а|у|е|і|ах)|катедр(и|і|а|у|ах)).*\\?`,
  ]);
};