import { Response, ResponseGoal } from '../core/response';
import { faculties } from '../utils/aliases';
import { any } from '../utils/regex';

export default class extends Response {
  goal = ResponseGoal.FACULTY;
  reply = 'Полезная информация о факультете:';
  expression = any([
    `(чем|чим|почему|чому|в каком плане|у якому (сенсі|плані)).*(${faculties}).*(лучше|кращ(а|е)|отлича(е|ю)ть?ся|відрізня(я|ю)ть?ся).*${faculties}?`,
    `${faculties}.*(лучше|краща|краще|или|чи|або).*${faculties}.*\\?`,
    '(расс?ка(зать|ж(е|и)те)|розка(зати|жіть)|поясн(іть|ите)).*(про|за|о(б)?).*(факультет|ф((і|и)(о|в))т(і|е)?)',
    'факультет.*(расс?ка(зать|жите)|розка(зати|жіть)|поясн(іть|ите)).*\\?',
    '(что|що|как|як).*(на|у|в).*ф((і|и)(о|в))т(і|е)?.*\\?',
  ]);
};